Revit 2024 API
BuiltInFailures.ElectricalFailures.InvalidNumberOfCircuitValueForSwitchPanel Property
 The number of circuits on the switchboard currently exceeds the value you entered. Reduce the number of circuits on the equipment before changing this value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidNumberOfCircuitValueForSwitchPanel { get; }
Visual Basic
Public Shared ReadOnly Property InvalidNumberOfCircuitValueForSwitchPanel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidNumberOfCircuitValueForSwitchPanel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace